xuzizheng1/8051_learn_01/b017_num_pad_STC12C5616AD.c
/*********************************************************************************************
程序名：阵列键盘驱动程序 　　 
编写人：杜洋 　　 　
编写时间：　 2010年 10月 26日
硬件支持：STC12C5616AD 系列　　
接口说明：　　
	1. 使用 STC12C5616AD
	2. led正极接Vcc, 负极接 P37
	3. 数字pad接 P1 的八个引脚
	4. 烧录此程序，按数字pad的1灯亮，2灯灭
修改日志：　　
　　NO.1-								
/*********************************************************************************************
说明：

/*********************************************************************************************/

#include <STC12C5620AD.H> // STC12C5616AD 系列单片机头文件


sbit LED = P3 ^ 7;

#define KEY P1 

/*********************************************************************************************
函数名：毫秒级CPU延时函数
调  用：DELAY_MS (?);
参  数：1~65535（参数不可为0）
返回值：无
结  果：占用CPU方式延时与参数数值相同的毫秒时间
备  注：应用于1T单片机时i<600，应用于12T单片机时i<125
/*********************************************************************************************/
void DELAY_MS (unsigned int a){
	unsigned int i;
	while( a-- != 0){
		for(i = 0; i < 600; i++);
	}
}
/*********************************************************************************************/

/*********************************************************************************************
函数名：阵列键盘处理函数
调  用：? =  Key (void);
参  数：无
返回值：0~0xff
结  果：连接Px接口的键盘读出返回值
备  注：
/*********************************************************************************************/
unsigned char Key (void){//键盘处理函数
	unsigned char a,b,c;//定义3个变量
	KEY = 0x0f;//键盘口置 00001111
	if(KEY != 0x0f){ //查寻键盘口的值是否变化
		DELAY_MS (20);//延时20毫秒
   		if(KEY != 0x0f){//有键按下处理
	  		a = KEY;//键值放入寄存器a
		}
		KEY = 0xf0;//将键盘口置为 11110000
		c = KEY;//将第二次取得值放入寄存器c
		a = a|c;//将两个数据相或
		switch(a){//对比数据值
			/*
			case 0xee: b = 1; break;//对比得到的键值给b一个应用数据
			case 0xed: b = 2; break;
			case 0xeb: b = 3; break;
	   		case 0xe7: b = 4; break;
	   		case 0xde: b = 5; break;
	   		case 0xdd: b = 6; break;
	   		case 0xdb: b = 7; break;
	   		case 0xd7: b = 8; break;
	   		case 0xbe: b = 9; break;
	   		case 0xbd: b = 10; break;
	   		case 0xbb: b = 11; break;
	   		case 0xb7: b = 12; break;
	   		case 0x7e: b = 13; break;
	   		case 0x7d: b = 14; break;
	   		case 0x7b: b = 15; break;
	   		case 0x77: b = 16; break;
			*/
			case 0xee: b = 'D'; break;  // 1110 1110
			case 0xed: b = '#'; break;
			case 0xeb: b = '0'; break;
	   		case 0xe7: b = '*'; break;
	   		case 0xde: b = 'C'; break;
	   		case 0xdd: b = '9'; break;
	   		case 0xdb: b = '8'; break;
	   		case 0xd7: b = '7'; break;
	   		case 0xbe: b = 'B'; break;
	   		case 0xbd: b = '6'; break;
	   		case 0xbb: b = '5'; break;
	   		case 0xb7: b = '4'; break;
	   		case 0x7e: b = 'A'; break;
	   		case 0x7d: b = '3'; break;
	   		case 0x7b: b = '2'; break;
	   		case 0x77: b = '1'; break;
			default: b = ' '; break;//键值错误处理
	   }
	}
	return (b);//将b作为返回值
}
/*********************************************************************************************/
void main (void){ //主程序 
	while(1){
		if(Key() == '1'){
			LED = 0;		//取LED相反状态
		}
		if(Key() == '2'){
			LED = 1;		//取LED相反状态
		}
	}
}
/*********************************************************************************************/
/*************************************************************
* 杜洋工作室 www.DoYoung.net
/*************************************************************/
